<?php

$textcyr="Златко Младеновиќ";
    $textlat="Zlatko Mladenovikj";
        $cyr = array('љ','њ','е','р','т','ѕ','у','и','о','п','ш','ѓ',
						'а','с','д','ф','г','х','ј','к','л','ч','ќ','ж',
						   'з','џ','ц','в','б','н','м',
           			 'Љ','Њ','Е','Р','Т','Ѕ','У','И','О','П','Ш','Ѓ',
						'А','С','Д','Ф','Г','Х','Ј','К','Л','Ч','Ќ','Ж',
						   'З','Џ','Ц','В','Б','Н','М');
		$lat = array('q','w','e','r','t','y','u','i','o','p','[',']',
			    	    'a','s','d','f','g','h','j','k','l',';',"'",' \ ',
				  		   'z','x','c','v','b','n','m',
                     'Q','W','E','R','T','Y','U','I','O','P','{','}',
					    'A','S','D','F','G','H','J','K','L',':','"','|',
						   'Z','X','C','V','B','N','M');

$textcyr = str_replace($cyr, $lat, $textcyr);
	$textlat = str_replace($lat, $cyr, $textlat);
    	echo("$textcyr <br/> $textlat");